## Production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 8 to add, 3 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                    NAME                                     |
|--------|-----------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.callback-max-retry-failures[0]`           |
|        | `aws_cloudwatch_log_metric_filter.github-arc-runner-alarm[0]`               |
|        | `aws_cloudwatch_metric_alarm.github-arc-runner-error-alarm[0]`              |
|        | `aws_cloudwatch_metric_alarm.service-callback-too-many-failures-warning[0]` |
|        | `aws_cloudwatch_query_definition.admin-50X-errors[0]`                       |
|        | `aws_cloudwatch_query_definition.api-50X-errors[0]`                         |
|        | `aws_cloudwatch_query_definition.callback-failures-by-service[0]`           |
|        | `aws_cloudwatch_query_definition.gh-arc-errors[0]`                          |
| delete | `aws_cloudwatch_log_metric_filter.github-arc-write-alarm[0]`                |
|        | `aws_cloudwatch_metric_alarm.github-arc-runner-write-alarm[0]`              |
|        | `aws_cloudwatch_query_definition.admin-api-50X-errors[0]`                   |
| update | `aws_cloudwatch_query_definition.bounce-rate-critical[0]`                   |
|        | `aws_cloudwatch_query_definition.bounce-rate-warning[0]`                    |
|        | `aws_cloudwatch_query_definition.bounce-rate-warnings-and-criticals[0]`     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.callback-max-retry-failures[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "callback-max-retry-failures" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application"
      + name           = "callback-max-retry-failures"
      + pattern        = "send_delivery_status_to_service has retried the max num of times for callback url"

      + metric_transformation {
          + name      = "callback-max-retry-failures"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.github-arc-runner-alarm[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "github-arc-runner-alarm" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application"
      + name           = "GitHub ARC Runners Write Alarm"
      + pattern        = "{ $.kubernetes.pod_name = \"github-arc-ss-production-*-runner-*\"  && $.log = \"*ERROR*\" }"

      + metric_transformation {
          + name      = "aggregating-github-arc-runner-alarm"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.github-arc-write-alarm[0] will be destroyed
  # (because aws_cloudwatch_log_metric_filter.github-arc-write-alarm is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "github-arc-write-alarm" {
      - id             = "GitHub ARC Runners Write Alarm" -> null
      - log_group_name = "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application" -> null
      - name           = "GitHub ARC Runners Write Alarm" -> null
      - pattern        = "WRITE ERROR" -> null

      - metric_transformation {
          - dimensions = {} -> null
          - name       = "aggregating-github-arc-write-alarm" -> null
          - namespace  = "LogMetrics" -> null
          - unit       = "None" -> null
          - value      = "1" -> null
        }
    }

  # aws_cloudwatch_metric_alarm.github-arc-runner-error-alarm[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "github-arc-runner-error-alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + alarm_description                     = "GitHub ARC Runners Are Failing"
      + alarm_name                            = "github-arc-runner-error-alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "aggregating-github-arc-runner-alarm"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.github-arc-runner-write-alarm[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.github-arc-runner-write-alarm is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "github-arc-runner-write-alarm" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> null
      - alarm_description         = "GitHub ARC Runners Are Failing - Check Version Deprecation" -> null
      - alarm_name                = "github-arc-runner-write-alarm" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:296255494825:alarm:github-arc-runner-write-alarm" -> null
      - comparison_operator       = "LessThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "github-arc-runner-write-alarm" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "aggregating-github-arc-write-alarm" -> null
      - namespace                 = "LogMetrics" -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> null
      - period                    = 300 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_cloudwatch_metric_alarm.service-callback-too-many-failures-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "service-callback-too-many-failures-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Service reached the max number of callback retries 5 times in 30 minutes"
      + alarm_name                            = "service-callback-too-many-failures-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "callback-max-retry-failures"
      + namespace                             = "LogMetrics"
      + period                                = 1800
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 5
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_query_definition.admin-50X-errors[0] will be created
  + resource "aws_cloudwatch_query_definition" "admin-50X-errors" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application",
        ]
      + name                = "Admin / 50X errors"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.container_name like /admin/
            | filter @message like /HTTP\/\d+\.\d+\\" 50\d/
            | sort @timestamp desc
            | limit 20
        EOT
    }

  # aws_cloudwatch_query_definition.admin-api-50X-errors[0] will be destroyed
  # (because aws_cloudwatch_query_definition.admin-api-50X-errors is not in configuration)
  - resource "aws_cloudwatch_query_definition" "admin-api-50X-errors" {
      - id                  = "3fe6c04d-0e4c-44af-9ca5-18c0af5b4174" -> null
      - log_group_names     = [
          - "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application",
        ] -> null
      - name                = "ADMIN & API - 50X errors" -> null
      - query_definition_id = "3fe6c04d-0e4c-44af-9ca5-18c0af5b4174" -> null
      - query_string        = <<-EOT
            fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.container_name like /admin|api/
            | filter @message like /HTTP\/\d+\.\d+\\" 50\d/
            | sort @timestamp desc
            | limit 20
        EOT -> null
    }

  # aws_cloudwatch_query_definition.api-50X-errors[0] will be created
  + resource "aws_cloudwatch_query_definition" "api-50X-errors" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application",
        ]
      + name                = "API / 50X errors"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.container_name like /api/
            | filter @message like /HTTP\/\d+\.\d+\\" 50\d/
            | sort @timestamp desc
            | limit 20
        EOT
    }

  # aws_cloudwatch_query_definition.bounce-rate-critical[0] will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "bounce-rate-critical" {
        id                  = "b286d3c5-579c-4bed-8354-4ea30d25b0e4"
      ~ name                = "Critical bounces" -> "Bounces / Critical bounces"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_query_definition.bounce-rate-warning[0] will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "bounce-rate-warning" {
        id                  = "591e1894-3a40-4a7c-8be2-b2449f75cfcb"
      ~ name                = "Warning bounces" -> "Bounces / Warning bounces"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_query_definition.bounce-rate-warnings-and-criticals[0] will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "bounce-rate-warnings-and-criticals" {
        id                  = "b84de86a-4513-40ec-83b7-a8e9c24a210e"
      ~ name                = "Bounce warnings and criticals grouped by type" -> "Bounces / Bounce warnings and criticals grouped by type"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_query_definition.callback-failures-by-service[0] will be created
  + resource "aws_cloudwatch_query_definition" "callback-failures-by-service" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application",
        ]
      + name                = "Callbacks / Count of callbacks that exceeded MaxRetries by service"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @service_id, @callback_url, @notification_id
            | filter kubernetes.container_name like /^celery/
            | filter @message like /send_delivery_status_to_service has retried the max num of times for callback url/
            | parse @message 'Retry: send_delivery_status_to_service has retried the max num of times for callback url * and notification_id: * for service: *' as @callback_url, @notification_id, @service_id
            | sort @timestamp desc
            | stats count(@service_id) by @service_id, bin(30m)
            | limit 10000
        EOT
    }

  # aws_cloudwatch_query_definition.gh-arc-errors[0] will be created
  + resource "aws_cloudwatch_query_definition" "gh-arc-errors" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application",
        ]
      + name                = "CICD / GitHub ARC Errors"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream, @log
            | filter @message like /ERR|Exception/
            | filter kubernetes.namespace_name = "github-arc-controller"
            | sort @timestamp desc
            | limit 100
        EOT
    }

Plan: 8 to add, 3 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main -...
```

</details>
